# Taps
tap "go-gitea/gitea"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "mongodb/brew"
tap "osx-cross/arm"
tap "osx-cross/avr"
tap "stripe/stripe-cli"
tap "universal-ctags/universal-ctags"
tap "wagoodman/dive"

# Brews
brew "openssl@1.1"
brew "readline"
brew "sqlite"
brew "asciinema"
brew "libffi"
brew "python"
brew "glib"
brew "avrdude"
brew "bash"
brew "cairo"
brew "clang-format"
brew "cmake"
brew "cocoapods"
brew "colordiff"
brew "commandbox"
brew "coreutils"
brew "llvm"
brew "cquery"
brew "dash"
brew "dfu-programmer"
brew "dfu-util"
brew "direnv"
brew "duti"
brew "elm", link: false
brew "go"
brew "exa"
brew "exiftool"
brew "fd"
brew "libtool"
brew "fontforge"
brew "fzf"
brew "webp"
brew "libxml2"
brew "unixodbc"
brew "gdb"
brew "git"
brew "git-flow"
brew "gnupg"
brew "graphviz"
brew "gtk+3"
brew "hashcat"
brew "hexyl"
brew "hstr"
brew "hub"
brew "hyperfine"
brew "imagemagick"
brew "jq"
brew "libxslt"
brew "libyaml"
brew "lua@5.1"
brew "luarocks"
brew "protobuf"
brew "mitmproxy"
brew "mosh"
brew "neovim"
brew "netcat"
brew "nginx", restart_service: true
brew "nnn"
brew "pgcli"
brew "postgresql", restart_service: true
brew "postgis"
brew "python@2"
brew "redis", restart_service: true
brew "rename"
brew "rfc"
brew "ripgrep"
brew "ruby", link: true
brew "sdl2"
brew "sdl2_image"
brew "sdl2_ttf"
brew "shellcheck"
brew "socat"
brew "swiftformat"
brew "tldr"
brew "tmux"
brew "tokei"
brew "tree"
brew "watch"
brew "watchman"
brew "wget"
brew "zlib"
brew "zsh"
brew "go-gitea/gitea/gitea"
brew "mongodb/brew/mongodb-community"
brew "osx-cross/arm/arm-gcc-bin@8", link: true
brew "osx-cross/avr/avr-gcc@8", link: true
brew "stripe/stripe-cli/stripe"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]
brew "mas"

# Casks
cask "osxfuse"
cask "alacritty"
cask "dbeaver-community"
cask "font-iosevka"
cask "iina"
cask "java"
cask "java8"
cask "obs"
cask "transmission"
cask "virtualbox"
cask "google-chrome"
cask "firefox"
cask "telegram"
cask "discord"
cask "viber"
cask "dash"
cask "homebrew/cask-versions/1password-beta"
cask "grammarly"
cask "epic-games"
cask "gog-galaxy"
cask "steam"
cask "figma"
cask "sketch"
cask "contraste"
cask "little-snitch"
cask "turbo-boost-switcher"
cask "daisydisk"
cask "appcleaner"
cask "gfxcardstatus"
cask "alfred"
cask "homebrew/cask-drivers/steelseries-engine"
cask "docker"

# Mac AppStore
mas "Things", id: 904280696
mas "Airmail", id: 918858936
mas "Annotate", id: 918207447
mas "Xcode", id: 497799835
mas "Bear", id: 1091189122
mas "Pages", id: 409201541
mas "Magnet", id: 441258766
mas "Fantastical", id: 975937182
mas "Be Focused Pro – Focus Timer", id: 961632517
